/**
 ** //! i have 3 key word to write a variable
 * var
 * let
 * const --> مقدرش اغير قيمتها يعني هي بتتعرف مره واحه و بس
 */
// *************************
/** // ! Type of data type
 * string
 * number -->int , float , double
 * boolen
 * null
 * undefind
 */
//**************************

/*
 * //! concatenation
 * to concate two string values , authr  thing
 */
//***************************
/**
 ** //! arithmatec operator
 * +
 * -
 * /
 * %
 * **
 * ++
 * --
 */
//**************************

/** // ! to invert string to num
 * Number()
 * parseInt()
 * parseFloat()
 */
//**************************
/** // ! if-else  //  else if
 * 1 دي جكله شرطيه يعني لو الشرط صح نفذ الشي الفلاني غلط مش حتعمل حاجه
 *
 * 2 حستخدمها لو عندي اكتر من شرط
 */
/******************************************************************* 
 /** اكتر حاجه بحفظها و انساها 
  ** //! = | == | ===
  * 1 --> علامه يساوي عاديه جدا 
  * 2 --> commbare  mauitable value يعني بتقارن قيمه بقيه 
  * 3 -->strict equality بتقارن القيمه و النوع 
  */
//*****************************
/**
 ** //!  promt ()
 *  to take a value from user
 */
//*****************************
/**
 ** //! Conditional Ternaly Operator
 * condition ? if true : if false
 */
//*********************************** */
/**
 ** // ! Function
 *  دي زي الماكينه بتدسها مدخلات عشان تطلعلك مخرجات
 *  كمان عنها ميزه الscope  varibles
 * كمان بنطبق بيها DRY
 * orginuze code
 * لقدر استخدم الكود اكتر من مره
 * كمان حاول تخلي الfunc  تعمل حاجه واحده
 *
 * Return ===> كلمه ريتيرن دي معناها خد النتيجه دي و اخرج
 * كمان  اي كود تحتها مش حيتنفذ
 *
 */
/**************************** */
/**
 ** // !   Hoisting
 * الجافا بتعمل ما يسمي تجهيز او تهيئه --> بتقوم بنقل كل تعريفات المتعغيرات و الفانكشن العاديه لفوق
 * بحيث يبقي هي مخزنهى المتغير ولما تقابل المتغير مع القيمه تقوم مدياله القيمه علي طول و ده اللي مخلي الغه دي سريعه
 * كمان الهويستنج مش موجود غير في الجافا اسكربت
 *
 */
/**************************** */
/**
 ** // !   Scope
 *Global
 *Funtion
 * Block
 *
 */
/**************************** */
/*
 ** // ! felf invoked func 
 *دي بتعمل كول لنفسها 
 *(function (){ console.log(`صلي ع النبي`); })();
 *
 *
 */
/**************************** */
/*
 ** // ! Expression func :
 *هي طريقه لتعريف فانكشن و اسنادها لمتغير 
 *
 *
 *
 */
/**************************** */
/*
 ** // ! Object --> None primative data type 
 *بتخزن اكتر من قيمه 
 *زي اخر مثال تحت 
 *
 *وعندي حاجه اسمها نيستيد object 

//***************************

for (var i = 1; i < 5; i++) {
  console.log(i);
}

console.log(`*************************************`);

var x = 1;
while (x <= 5) {
  console.log(x);
  ++x;
}

console.log(`*************************************`);

var y = 1;
do {
  console.log(y);
  y++;
} while (y <= 5);

//****************************** */

function get_avg() {
  var x = 2;
  var y = 4;
  var sum = x + y;
  var avg = sum / 2;
  console.log(avg);
}
get_avg();

//****************************** */

let me = {
  name: `mojahid`,
  age: 20,
  phone: 1146367801,
  edu: {
    uni: `HNU`,
    faculty: `CS`,
    major: `DS`,
  },
};

console.log(`Iam ${me.name}`);
console.log(`my uni is ${me.edu.uni}`);
